Repository: Kostenkov-2021/enhanced_language_switching-Russian-locale
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: Enhanced Language Detection
ru: Enhanced Language Detection (Улучшенное обнаружение языков)

source: lingua (recommended)
ru: lingua (рекомендуется)

source: language detection library
ru: библиотека определения языка

source: always interpret
ru: всегда определять

source: only interpret if the text doesn't instruct NVDA to change language
ru: определять только тогда, когда текст не содержит инструкций для изменения языка

source: never interpret (NVDA's default behavior)
ru: никогда не определять (поведение NVDA по умолчанию)

source: Language interpretation:
ru: Определять язык::

source: Detect multiple languages in the same text
ru: Определять несколько языков в одном тексте

source: Languages to interpret
ru: Определяемые языки

source: Automaticly detects the language of the text NVDA is about to speak, and uses NVDA's built in auto language switching, if turned on, to sspeak the text in that language
ru: Это дополнение автоматически определяет язык текста, который собирается произнести NVDA, и использует встроенное в NVDA автоматическое переключение языка, если оно включено, для произнесения текста на этом языке
